target guided ordinal encoding

In [19]:
import pandas as pd

In [20]:
df=pd.DataFrame({
"city":("new york","london","up","paris","delhi","tokyo","paris","delhi","up"),
"price":(400,500,900,600,1000,700,300,1500,1200)

})

In [21]:
#calculate mean price for each city

mean_price=df.groupby("city")["price"].mean()

In [22]:
#replace each city with its mean price
df["city_encoded"]=df["city"].map(mean_price)

In [23]:
df

       city  price  city_encoded
0  new york    400         400.0
1    london    500         500.0
2        up    900        1050.0
3     paris    600         450.0
4     delhi   1000        1250.0
5     tokyo    700         700.0
6     paris    300         450.0
7     delhi   1500        1250.0
8        up   1200        1050.0

In [24]:
mean_price

city
delhi       1250.0
london       500.0
new york     400.0
paris        450.0
tokyo        700.0
up          1050.0
Name: price, dtype: float64

practice

In [25]:
import seaborn as sns

In [27]:
df=sns.load_dataset("tips")

In [28]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [31]:
mean_of_day=df.groupby("day")["total_bill"].mean()

In [32]:
df["mean_day"]=df["day"].map(mean_of_day)

In [38]:
df[["day","mean_day"]]

      day   mean_day
0     Sun  21.410000
1     Sun  21.410000
2     Sun  21.410000
3     Sun  21.410000
4     Sun  21.410000
..    ...        ...
239   Sat  20.441379
240   Sat  20.441379
241   Sat  20.441379
242   Sat  20.441379
243  Thur  17.682742

[244 rows x 2 columns]